src/cfe/osn/Documents/ЗаказНаВнутреннееПотребление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаВнутреннееПотребление</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>_ЗаявкаНаЗакупку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаЗакупку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>_УИДЗаказ</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>_Отгрузка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>_УИДОтгрузка</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/osn/Documents/ЗаказНаВнутреннееПотребление/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
&После("УстановитьУсловноеОформление")
Процедура Расш1_УстановитьУсловноеОформление()

	//++ Сухарев Б.В. 05.08.2019
	 Если Объект.Закрыт Тогда
	 	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюСоздатьНаОсновании.Доступность = НЕ Объект.Закрыт;
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюЗаполнить.Доступность		   = НЕ Объект.Закрыт;
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппаКомандыФормы.Доступность   = НЕ Объект.Закрыт;
	 КонецЕсли;
	//== Сухарев Б.В
	
КонецПроцедуры

&НаСервере
Процедура Кт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
		
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Закрыт", Тип("ПолеФормы"),Элементы.Шапка);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.Закрыт";
		
	КонецЕсли;

	
	НовыйЭлемент  = Элементы.Добавить("_ЗаявкаНаЗакупку",Тип("ПолеФормы"),Элементы.Товары);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.Товары._ЗаявкаНаЗакупку";
	
КонецПроцедуры
